[
    {
        "id": 1,
        "source": "RTE.ie",
        "title": "National emergency team to meet as temperatures drop",
        "content": "<br>The National Emergency Co-ordination Group is meeting in Dublin this morning to assess the impact of the cold snap.<br>Met Éireann has again issued a warning that pockets of freezing fog may cause hazardous conditions for road users.<br>Snow is forecast to fall in Dublin, Kildare and Wicklow."
    },
    {
        "id": 2,
        "source": "Independent.ie",
        "title": "Weather Ireland: Met Éireann issues nationwide Status Orange ice warning with snow warning for three counties",
        "content": "<br>Met Éireann has updated its weather warnings as Ireland is gripped by a big freeze.<br>A Status Orange warning for low temperatures and ice has been issued for the entire country and comes into effect from 5pm on Sunday until noon on Monday as temperatures are likely to fall below -5C in many areas.<br>It comes as Status Yellow snow warning was earlier issued for counties Dublin, Wicklow and Kildare. It comes into effect from 11pm tonight and lasts until noon on Sunday.<br>Met Éireann meteorologist Mathew Martin said localised \"snow showers\" are expected tonight and several centimetres is expected."
    },
    {
        "id": 3,
        "source": "BreakingNews.ie",
        "title": "Met Éireann warns of severe frost as sub-zero warnings extended",
        "content": "<br>A Status Orange low-temperature and ice warning has been issued for Sunday across Ireland.<br>The warning comes into effect from 5pm on Sunday until noon on Monday, with Met Éireann warning of “severe frost” and said that further icy conditions are to set in on Sunday night.<br>Temperatures are likely to fall below -5C in many areas, it said.<br>For counties Dublin, Kildare and Wicklow, a snow and ice warning is to take effect from 11pm on Saturday until noon on Sunday, with the most substantial snowfall expected on high ground.<br>It comes as the icy weather caused disruption for motorists and road users, and drivers were warned to look out for hazardous conditions such as black ice.<br>Earlier on Saturday, Met Eireann extended ice and freezing fog warnings for Ireland by 24 hours as dozens of flights were cancelled in and out of Dublin.<br>As of 9am, airlines have cancelled at least 23 outbound flights and 27 inbound flights on Saturday.<br>It comes after 69 departing flights and 74 inbound flights were cancelled last night.<br>The Dublin Airport Authority (DAA) said airlines have responsibility for de-icing planes, and this is what has caused the delays."
    },
    {
        "id": 4,
        "source": "TheJournal.ie",
        "title": "53 flights cancelled at Dublin Airport as passengers advised to check airlines for updates",
        "content": "<br>A TOTAL OF 53 flights in and out of Dublin Airport were cancelled today following yesterday’s disruption due to the cold weather.<br>Some 26 outbound flights and 27 inbound flights had been cancelled by 4:30pm today, daa media relations manager Graeme McQueen told The Journal.<br>143 flights were cancelled at the airport yesterday as airlines experienced difficulties trying to de-ice planes, with significant delays also being seen.<br>A nationwide Status Yellow freezing fog and ice warning remains in place until midday tomorrow, with Met Éireann warning of hazardous conditions and icy surfaces.<br>In a tweet this morning, Dublin Airport said it is “fully open and operational”.<br>“However, as a knock-on from the issues faced by airlines yesterday, a number of flights have been cancelled,” it said."
    },
    {
        "id": 5,
        "source": "DublinAirport",
        "title": "@DublinAirport is fully open as it has been since Friday but the bitterly cold weather may still impact your flight.",
        "content": "<br>Passengers should continue to contact their airline for flight information as cancellations are possible. Take care travelling to the airport & allow extra time. pic.twitter.com/OrtUbC9I2G"
    },
    {
        "id": 6,
        "source": "SkyNews",
        "title": "UK weather: 'Wintry hazards' of freezing fog, sleet and snow could disrupt travel for 'at least a week'",
        "content": "<br>Freezing fog, ice, sleet and snow are set to cause travel disruption across the UK, with airports temporarily closing runways and delaying flights due to the extreme cold weather.<br>Freezing fog, ice, sleet and snow are set to cause travel disruption for at least a week, with flights affected in the UK and Republic of Ireland, and more bitter weather to come.<br>Parts of Scotland, south-western England, the Midlands, north-western England and Wales were hit by snow on Saturday, causing travel disruptions."
    }
]